## Plan Result (stg-backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw"
        name                              = "cft-aks00-aat-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "aac-manage-case-assignment" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/adoption-cos-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "adoption-cos-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/am-accessmgmt-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "am-accessmgmt-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/am-judicial-booking-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "am-judicial-booking-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "am-org-role-mapping-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/am-role-assignment-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "am-role-assignment-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/bar-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "bar-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "bulk-scan-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "bulk-scan-payment-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/bulk-scan-processor" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "bulk-scan-processor" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/bulk-scan-sample-app" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "bulk-scan-sample-app" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/camunda-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "camunda-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/camunda-bpm" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "camunda-bpm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-admin-web" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-case-activity-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-case-activity-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-case-document-am-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-case-document-am-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-case-print-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-case-print-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-data-store-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-data-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-definition-store-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-definition-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-message-publisher" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-message-publisher" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-test-stubs-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-test-stubs-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccd-user-profile-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccpay-bulkscanning-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccpay-bulkscanning-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccpay-notifications-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccpay-notifications-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ccpay-refunds-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ccpay-refunds-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/civil-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "civil-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/cmc-claim-store" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "cmc-claim-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/cmc-pdf-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "cmc-pdf-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/ctsc-work-allocation" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ctsc-work-allocation" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/dg-docassembly" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "dg-docassembly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/dg-docmosis" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "dg-docmosis" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-cfs" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-cfs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-cms" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-cms" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-cos" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-dgs" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-emca" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-emca" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-fps" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-fps" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/div-hm" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "div-hm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw/backendAddressPools/dm-store" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

eways/cft-aks01-aat-agw/backendAddressPools/fprl-cos" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "fprl-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/fprl-dgs" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "fprl-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/hmc-cft-hearing-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "hmc-cft-hearing-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/hmc-hmi-inbound-adapter" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "hmc-hmi-inbound-adapter" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/hmc-hmi-outbound-adapter" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "hmc-hmi-outbound-adapter" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/ia-bail-case-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ia-bail-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/ia-case-access-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ia-case-access-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/idam-hmcts-access" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "idam-hmcts-access" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/idam-testing-support-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "idam-testing-support-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/idam-user-dashboard" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "idam-user-dashboard" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/plum-recipe-backend" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "plum-recipe-backend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/prl-cos" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "prl-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/prl-dgs" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "prl-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/rpts-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "rpts-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/sptribs-case-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "sptribs-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/sptribs-dss-backend" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "sptribs-dss-backend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/sscs-hearings-api" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "sscs-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/ts-translation-service" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "ts-translation-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/wa-case-event-handler" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "wa-case-event-handler" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/wa-task-monitor" -> null
          - ip_addresses = [
              - "10.10.143.250",
              - "10.10.159.250",
            ] -> null
          - name         = "wa-task-monitor" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "camunda-optimize"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "civil-general-applications"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "cpo-case-payment-orders-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "em-ped-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "et-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "et-msg-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "et-sya-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "fis-bulk-scan-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "fis-cos-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "fis-hmc-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "fprl-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "fprl-dgs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "hmc-cft-hearing-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "hmc-hmi-inbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "hmc-hmi-outbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "ia-bail-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "ia-case-access-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "idam-hmcts-access"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "idam-testing-support-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "idam-user-dashboard"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "plum-recipe-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "prl-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "prl-dgs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "rpts-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "sptribs-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "sptribs-dss-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "sscs-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "ts-translation-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "wa-case-event-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.159.250",
            ]
          + name         = "wa-task-monitor"
        }

        # (130 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1393,"Program":"tfcmt","SHA1":"","Target":"stg-backendappgateway","Vars":{}} -->